<!-- dflook/terraform-github-actions {"workspace":"checkoutv3","backend":"f5a30c2311c6f32059a906f274fda22d89ea56872b28f911b8d4e3641ab6ab93","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #253 at https://github.com/dflook/terraform-github-actions/actions/runs/3245550357","plan_hash":"056cd07592203697edd7be0473dd4fdd0031fcd7c3988c56f311188cc9c71b7a","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __checkoutv3__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "p5kSODGlTt" -> (known after apply)
  ~ foreach = "mEUOXWmP1U" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #253](https://github.com/dflook/terraform-github-actions/actions/runs/3245550357)